{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "hi",
                "how are you?",
                "hello",
                "hey",
                "good morning",
                "good afternoon",
                "good evening",
                "what's up?",
                "yo",
                "greetings"
            ],
            "responses": [
                "Hi there! Welcome to information about PGRKAM. How can I assist you today?",
                "Hello! I'm here to provide details on pgrkam.com. What do you need?",
                "Hey! Glad you're here. Ask me anything about Punjab Ghar Ghar Rozgar and Karobar Mission.",
                "Hi! How can I help you with PGRKAM queries?",
                "Hello, hope you're doing well. What would you like to know about the website?",
                "Hey there! Ready to dive into PGRKAM details?",
                "Hi! I'm your guide to pgrkam.com. What's your question?",
                "Greetings! Let's talk about employment opportunities via PGRKAM.",
                "Hello! Excited to share info on Punjab's job mission.",
                "Hi, nice to connect! How may I assist with PGRKAM info?"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "thank you",
                "thanks a lot",
                "appreciate it",
                "thanks",
                "thank you so much",
                "much appreciated",
                "cheers",
                "thanks heaps",
                "grateful",
                "ty"
            ],
            "responses": [
                "You're welcome! If you have more questions about PGRKAM, just ask.",
                "No problem! Happy to help with pgrkam.com details.",
                "Glad I could assist! Anything else on Punjab Rozgar?",
                "Anytime! Reach out for more info on job opportunities.",
                "You're welcome! Let me know if you need further PGRKAM guidance.",
                "Happy to help! More questions about the mission?",
                "No worries! I'm here for all your PGRKAM queries.",
                "You're welcome! Excited to support your employment journey.",
                "Don't mention it! Ask away about pgrkam.com.",
                "Pleasure's mine! What else can I tell you about PGRKAM?"
            ]
        },
        {
            "tag": "about_pgrkam",
            "patterns": [
                "What is PGRKAM?",
                "Tell me about pgrkam.com",
                "What does PGRKAM stand for?",
                "What is Punjab Ghar Ghar Rozgar?",
                "Explain PGRKAM mission",
                "What is the purpose of pgrkam.com?",
                "Info on Punjab Rozgar Department",
                "What is Ghar Ghar Rozgar and Karobar Mission?",
                "Describe PGRKAM",
                "Background on pgrkam.com",
                "What services does PGRKAM offer?",
                "Is PGRKAM a government website?",
                "When was PGRKAM launched?",
                "Who runs pgrkam.com?",
                "What is the goal of PGRKAM?",
                "Tell me more about Punjab employment mission",
                "What does the PGRKAM website do?",
                "Overview of PGRKAM",
                "PGRKAM details please",
                "What is this website about?"
            ],
            "responses": [
                "PGRKAM stands for Punjab Ghar Ghar Rozgar and Karobar Mission, a Punjab Government initiative launched on October 3, 2018, by the Department of Employment Generation and Training to address unemployment by facilitating wage and self-employment.",
                "pgrkam.com is the official portal of Punjab Rozgar Department, helping Punjab residents with job opportunities, career counseling, and skill development programs.",
                "The main purpose of PGRKAM is to improve employability and connect job seekers with employers across India through a unified platform.",
                "PGRKAM aims to provide necessary framework for employment and self-employment for unemployed people in Punjab.",
                "Launched in 2018, PGRKAM is managed by the Punjab Government to offer job listings, training, and employment services.",
                "pgrkam.com connects job seekers and employers, offering registration for opportunities, training programs, and more.",
                "PGRKAM is a government mission to tackle unemployment in Punjab through job fairs, skill enhancement, and career guidance.",
                "The website pgrkam.com is the hub for Punjab's employment initiatives, including government and private job postings.",
                "PGRKAM focuses on wage employment and self-employment (karobar) opportunities for Punjab youth.",
                "For more details, PGRKAM is affiliated with the Dept. of Employment Generation and Training, Punjab."
            ]
        },
        {
            "tag": "registration",
            "patterns": [
                "How to register on pgrkam.com?",
                "How do I sign up for PGRKAM?",
                "Registration process for PGRKAM",
                "How to create an account on the website?",
                "Sign up for job seekers on pgrkam.com",
                "How to join PGRKAM?",
                "Steps to register for employment services",
                "Can I register online for PGRKAM?",
                "How to apply for jobs via PGRKAM?",
                "Registration link for pgrkam.com",
                "How to become a member of PGRKAM?",
                "Guide to signing up on Punjab Rozgar portal",
                "Do I need to register to use pgrkam.com?",
                "How to get started with PGRKAM?",
                "Registration for employers on PGRKAM",
                "How to enroll in skill programs?",
                "Sign up instructions for pgrkam.com",
                "What documents for PGRKAM registration?",
                "Online registration for Punjab jobs",
                "How to access my PGRKAM account?"
            ],
            "responses": [
                "To register on pgrkam.com, visit https://pgrkam.com/signup and fill in your details as a job seeker or employer.",
                "Sign up is easy: Go to the PGRKAM website, click on signup, provide your personal info, and verify your account.",
                "Registration on pgrkam.com connects you to job opportunities and training; start at the signup page.",
                "For job seekers, register online at pgrkam.com to access employment services and skill programs.",
                "Employers can also register on PGRKAM to post jobs and connect with candidates.",
                "The registration process is free and online via the official portal for Punjab residents.",
                "After signing up, you can log in to browse jobs, apply, and attend virtual job fairs.",
                "Visit https://pgrkam.com/signup to create your profile for wage or self-employment opportunities.",
                "Registration requires basic details like name, contact, and qualifications; no specific documents mentioned upfront.",
                "Get started by registering on pgrkam.com to unlock career counseling and job alerts."
            ]
        },
        {
            "tag": "job_opportunities",
            "patterns": [
                "What jobs are available on pgrkam.com?",
                "How to find jobs on PGRKAM?",
                "Government jobs on PGRKAM",
                "Private jobs via pgrkam.com",
                "Job listings on Punjab Rozgar portal",
                "What employment opportunities does PGRKAM offer?",
                "Search for jobs in Punjab",
                "Are there self-employment options?",
                "Karobar opportunities on PGRKAM",
                "Latest job vacancies on the website",
                "How to apply for jobs through PGRKAM?",
                "Job fairs on pgrkam.com",
                "Wage employment on PGRKAM",
                "Find work in Punjab via this site",
                "What types of jobs are posted?",
                "Unemployment solutions via PGRKAM",
                "Job search features on the portal",
                "Current openings on pgrkam.com",
                "How does PGRKAM help with jobs?",
                "Employment generation in Punjab"
            ],
            "responses": [
                "pgrkam.com lists government jobs at https://www.pgrkam.com/govt-jobs and private opportunities for Punjab residents.",
                "You can search for jobs on PGRKAM by registering and browsing listings for wage and self-employment.",
                "PGRKAM offers job opportunities, including government positions, skill-based roles, and business startups (karobar).",
                "Check the portal for latest vacancies, job fairs, and career counseling to find suitable employment.",
                "The website connects you to employers across India for various job types in Punjab.",
                "For self-employment, PGRKAM provides guidance on starting businesses and accessing schemes.",
                "Government jobs are highlighted on the site, with links to apply directly.",
                "PGRKAM hosts job fairs and events to match seekers with opportunities.",
                "Browse jobs by category, location, or skills on the unified employment portal.",
                "To apply, register, search openings, and submit your profile via pgrkam.com."
            ]
        },
        {
            "tag": "skill_development",
            "patterns": [
                "What skill programs on PGRKAM?",
                "Skill development via pgrkam.com",
                "Training courses on Punjab Rozgar",
                "How to improve employability with PGRKAM?",
                "Skill enhancement programs",
                "What training does PGRKAM offer?",
                "Career counseling on the website",
                "Vocational training in Punjab",
                "Skill building opportunities",
                "Programs to learn new skills",
                "How to enroll in training?",
                "PGRKAM skill development details",
                "Free training on pgrkam.com?",
                "What courses are available?",
                "Upskilling via Punjab mission",
                "Professional development on PGRKAM",
                "Training for unemployed youth",
                "Skill workshops and events",
                "How does PGRKAM help with skills?",
                "Education and training section"
            ],
            "responses": [
                "PGRKAM offers skill development programs to improve employability for unemployed youth in Punjab.",
                "Through pgrkam.com, access training courses, vocational programs, and career counseling services.",
                "Enroll in skill enhancement initiatives via the portal after registration.",
                "The mission includes workshops, online courses, and partnerships for professional development.",
                "Skill programs cover various sectors to match job market needs in Punjab.",
                "Career counseling is available to guide on training and job paths.",
                "Many programs are free or subsidized by the Punjab Government.",
                "Check the website for current training listings and enrollment.",
                "PGRKAM aims to upskill users for better wage and self-employment opportunities.",
                "Register on pgrkam.com to explore and apply for skill-building events."
            ]
        },
        {
            "tag": "events",
            "patterns": [
                "What events on PGRKAM?",
                "Job fairs via pgrkam.com",
                "Upcoming events in Punjab Rozgar",
                "PGRKAM workshops and seminars",
                "Are there job melas?",
                "Events for employment",
                "What’s happening on the portal?",
                "Career events on PGRKAM",
                "Festivals or fairs for jobs",
                "Schedule of PGRKAM events",
                "Virtual job fairs",
                "Training events details",
                "What gatherings does PGRKAM organize?",
                "Events for job seekers",
                "Punjab employment events",
                "How to attend PGRKAM events?",
                "Latest news on events",
                "Job expos on the website",
                "PGRKAM calendar",
                "Special programs or events"
            ],
            "responses": [
                "PGRKAM organizes job fairs, workshops, and career events to connect seekers with opportunities.",
                "Check pgrkam.com for upcoming job melas and virtual fairs in Punjab.",
                "Events include skill workshops, employment drives, and seminars for youth.",
                "Register on the portal to get notifications and attend PGRKAM events.",
                "Job fairs are a key feature, often held across Punjab districts.",
                "The website lists current and upcoming events for training and jobs.",
                "Participate in events to meet employers and learn about openings.",
                "PGRKAM events aim to boost employment through direct interactions.",
                "For details, visit the events section on pgrkam.com.",
                "Events are free for registered users and focus on unemployment solutions."
            ]
        },
        {
            "tag": "contact",
            "patterns": [
                "How to contact PGRKAM?",
                "Contact info for pgrkam.com",
                "PGRKAM address",
                "Email for Punjab Rozgar",
                "Phone number for PGRKAM",
                "How to reach out to the department?",
                "Support for the website",
                "PGRKAM helpline",
                "Where is PGRKAM office?",
                "Contact details please",
                "Query resolution for PGRKAM",
                "How to get in touch?",
                "Punjab employment contact",
                "Office location of PGRKAM",
                "Email address for inquiries",
                "Support team contact",
                "How to complain or suggest?",
                "PGRKAM customer service",
                "Contact for job issues",
                "Reach the mission team"
            ],
            "responses": [
                "Contact PGRKAM at pgrkam.degt@gmail.com or visit their office at SCO 149-152, 2nd Floor, Sector 17C, Chandigarh.",
                "For inquiries, email pgrkam.degt@gmail.com through the Punjab Rozgar Department.",
                "The head office is located in Chandigarh: SCO 149-152, Sector 17C.",
                "Use the contact form on pgrkam.com for support and queries.",
                "PGRKAM is reachable via email for job, training, or registration help.",
                "Address: Punjab Ghar Ghar Rozgar and Karobar Mission, SCO 149-152, 2nd Floor, Sector 17C, Chandigarh.",
                "For quick assistance, email pgrkam.degt@gmail.com with your details.",
                "No phone number listed, but email is the primary contact method.",
                "Visit the website for more contact options or district-level offices.",
                "Contact the Dept. of Employment Generation and Training via PGRKAM channels."
            ]
        }
    ]
}